app/controllers/static_pages_controller.rb

SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles" WHERE (LOWER(title) LIKE '%h%')
SELECT "authors".* FROM "authors" WHERE "authors"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "countries".* FROM "countries" WHERE "countries"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "articles".* FROM "articles" INNER JOIN "article_categories" ON "article_categories"."article_id" = "articles"."id" WHERE "article_categories"."category_id" = ? AND (LOWER(title) LIKE '%po%')  [["category_id", 2]]
---
  def home
    @categories = Category.all
    @articles = Article.includes(:author, :publisher, :countries)

    if params[:category_id].present?
      @articles = @articles.joins(:article_categories).where(article_categories: { category_id: params[:category_id] })